In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.912129 -0.374808
1  X   beta -0.984300 -0.803168
2  Y  alpha -1.675273 -0.424107
3  Y   beta  0.283508 -0.046811
4  Z  alpha -2.617770  0.611540

In [3]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [4]:
group1

In [6]:
group1.describe()

,count,mean,std,min,25%,50%,75%,max
k1,,,,,,,,
X,2.0,-0.948214,0.051033,-0.984300,-0.966257,-0.948214,-0.930171,-0.912129
Y,2.0,-0.695882,1.385068,-1.675273,-1.185578,-0.695882,-0.206187,0.283508
Z,1.0,-2.617770,NaN,-2.617770,-2.617770,-2.617770,-2.617770,-2.617770

In [8]:
group1.mean()

k1
X   -0.948214
Y   -0.695882
Z   -2.617770
Name: dataset1, dtype: float64

In [9]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [10]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.912129 -0.374808
1  X   beta -0.984300 -0.803168
2  Y  alpha -1.675273 -0.424107
3  Y   beta  0.283508 -0.046811
4  Z  alpha -2.617770  0.611540

In [16]:
dframe['dataset1'].groupby([cities]).mean()

LA   -1.329786
NY   -1.082130
Name: dataset1, dtype: float64

In [17]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.948214 -0.588988
Y  -0.695882 -0.235459
Z  -2.617770  0.611540

In [19]:
dframe['dataset1'].groupby(dframe['k1']).mean()

k1
X   -0.948214
Y   -0.695882
Z   -2.617770
Name: dataset1, dtype: float64

In [20]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.912129 -0.374808
1  X   beta -0.984300 -0.803168
2  Y  alpha -1.675273 -0.424107
3  Y   beta  0.283508 -0.046811
4  Z  alpha -2.617770  0.611540

In [25]:
dframe.groupby(['k1', 'k2'])['dataset2'].mean()

k1  k2
X   alpha   -0.374808
    beta    -0.803168
Y   alpha   -0.424107
    beta    -0.046811
Z   alpha    0.611540
Name: dataset2, dtype: float64

In [26]:
dframe.groupby(['k1', 'k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.912129 -0.374808
   beta  -0.984300 -0.803168
Y  alpha -1.675273 -0.424107
   beta   0.283508 -0.046811
Z  alpha -2.617770  0.611540

In [27]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [29]:
for n,g in dframe.groupby('k1'):
    print('This is the {} group'.format(n))
    print(g)
    print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha -0.912129 -0.374808
1  X   beta -0.984300 -0.803168


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -1.675273 -0.424107
3  Y   beta  0.283508 -0.046811


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  -2.61777   0.61154

In [30]:
gr = dframe.groupby('k1')

In [32]:
gr.mean()

    dataset1  dataset2
k1
X  -0.948214 -0.588988
Y  -0.695882 -0.235459
Z  -2.617770  0.611540

gr.get_group('X')

In [33]:
gr.get_group('X')

  k1     k2  dataset1  dataset2
0  X  alpha -0.912129 -0.374808
1  X   beta -0.984300 -0.803168

In [36]:
gr = dframe.groupby('k1')
group_dict = dict(list(gr))

In [37]:
group_dict['Y']

  k1     k2  dataset1  dataset2
2  Y  alpha -1.675273 -0.424107
3  Y   beta  0.283508 -0.046811